app/views/opinions/_opinion.html.erb

<div class='post-comments-section'>
    <% opinion.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."opinion_id" = $1  [["opinion_id", 11]]