app/controllers/followings_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "followings" ("follower_id", "followed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 12], ["followed_id", 11], ["created_at", "2021-05-02 16:25:11.332321"], ["updated_at", "2021-05-02 16:25:11.332321"]]
---
  def create
    @following = current_user.followings.new(followed_id: params[:user_id])
    @user = User.find_by_id!(user_params[:user_id])
    if @following.save
      flash[:notice] = "You are following #{User.find(params[:user_id]).fullname}"

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."followed_id" = $1 AND "followings"."follower_id" = $2 ORDER BY "followings"."id" ASC LIMIT $3  [["followed_id", 11], ["follower_id", 12], ["LIMIT", 1]]
---
  def destroy
    @user = User.find_by_id!(user_params[:user_id])
    follow = Following.where(followed_id: @user.id).where(follower_id: current_user.id).first