app/controllers/opinions_controller.rb

  def index
    @opinion = Opinion.new
    @opinions = Opinion.order_by_most_recent
---
SELECT "opinions".* FROM "opinions" ORDER BY "opinions"."created_at" DESC

  def create
    @opinion = current_user.opinions.build(opinion_params)
    if @opinion.save
---
INSERT INTO "opinions" ("text", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "tefgh"], ["author_id", 1], ["created_at", "2021-03-19 10:06:36.408139"], ["updated_at", "2021-03-19 10:06:36.408139"]]

  def edit
    @opinion = Opinion.find_by_id!(params[:id])
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @opinion = Opinion.find_by_id!(params[:id])

    if @opinion.update(opinion_params)
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "opinions" SET "text" = $1, "updated_at" = $2 WHERE "opinions"."id" = $3  [["text", "am how are you guys"], ["updated_at", "2021-05-03 10:46:35.709781"], ["id", 6]]

  def destroy
    @opinion = Opinion.find_by_id!(opinion_params[:opinion_id])
    @opinion.destroy
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "opinions" WHERE "opinions"."id" = $1  [["id", 12]]