app/controllers/users_controller.rb

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]