app/controllers/users_controller.rb

INSERT INTO "users" ("username", "fullname", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Tshepo"], ["fullname", "david"], ["created_at", "2021-03-21 09:58:17.454347"], ["updated_at", "2021-03-21 09:58:17.454347"]]
---
  def create
    @user = User.create(signup_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tshepo"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(username: params[:username])